/* DASDBLKS.H   (C) Copyright Roger Bowler, 1999-2012                */
/*              DASD control block structures                        */
/*                                                                   */
/*   Released under "The Q Public License Version 1"                 */
/*   (http://www.hercules-390.org/herclic.html) as modifications to  */
/*   Hercules.                                                       */

/*-------------------------------------------------------------------*/
/* This header file contains definitions of OS Data Management       */
/* control block structures for use by the Hercules DASD utilities.  */
/* It also contains function prototypes for the DASD utilities.      */
/*-------------------------------------------------------------------*/

#include "hercules.h"

/*-------------------------------------------------------------------*/
/* typedef forward references                                        */
/*-------------------------------------------------------------------*/
typedef  struct  VOL1_CKD       VOL1_CKD;       // VOL1 layout for CKD
typedef  struct  VOL1_FBA       VOL1_FBA;       // VOL1 layout for FBA

typedef  struct  FORMAT1_DSCB   FORMAT1_DSCB;   // DSCB1: Dataset descriptor
typedef  struct  FORMAT3_DSCB   FORMAT3_DSCB;   // DSCB3: Additional extents
typedef  struct  FORMAT4_DSCB   FORMAT4_DSCB;   // DSCB4: VTOC descriptor
typedef  struct  FORMAT5_DSCB   FORMAT5_DSCB;   // DSCB5: Free space map

typedef  struct  F5AVEXT        F5AVEXT;        // Available extent in DSCB5
typedef  struct  DSXTENT        DSXTENT;        // Dataset extent descriptor

typedef  struct  PDSDIR         PDSDIR;         // PDS directory entry
typedef  struct  CIFBLK         CIFBLK;         // CKD image file descriptor

typedef  struct  COPYR1         COPYR1;         // IEBCOPY header record 1
typedef  struct  COPYR2         COPYR2;         // IEBCOPY header record 2
typedef  struct  DATABLK        DATABLK;        // IEBCOPY unload data rec

#define  MAX_TRACKS   32767

/*-------------------------------------------------------------------*/
/*  VOL1 label and IPL text constants                                */
/*-------------------------------------------------------------------*/
static const BYTE VOL1_KEYA[4]  = {'V', 'O', 'L', '1' };   /* ASCII  "VOL1" */
static const BYTE VOL1_KEY[4]   = {0xE5,0xD6,0xD3,0xF1};   /* EBCDIC "VOL1" */
static const BYTE IPL1_KEY[4]   = {0xC9,0xD7,0xD3,0xF1};   /* EBCDIC "IPL1" */
static const BYTE IPL2_KEY[4]   = {0xC9,0xD7,0xD3,0xF2};   /* EBCDIC "IPL2" */

#define HERC_OWNERA "** HERCULES **"  /* (ASCII, 14-bytes, centered) */

#define VOL1_KEYLEN       4
#define IPL1_KEYLEN       4
#define IPL2_KEYLEN       4

#define VOLSER_LEN        6
#define VOL1_DATALEN     80
#define IPL1_DATALEN     24
#define IPL2_DATALEN    144

static const BYTE   iplpsw [8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
static const BYTE   iplccw1[8] = {0x06, 0x00, 0x3A, 0x98, 0x60, 0x00, 0x00, 0x60};
static const BYTE   iplccw2[8] = {0x08, 0x00, 0x3A, 0x98, 0x00, 0x00, 0x00, 0x00};

static const BYTE noiplpsw [8] = {0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0F};
static const BYTE noiplccw1[8] = {0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01};
static const BYTE noiplccw2[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

static const BYTE ipl2data[43] = {0x07, 0x00, 0x3A, 0xB8, 0x40, 0x00, 0x00, 0x06,
                                  0x31, 0x00, 0x3A, 0xBE, 0x40, 0x00, 0x00, 0x05,
                                  0x08, 0x00, 0x3A, 0xA0, 0x00, 0x00, 0x00, 0x00,
                                  0x06, 0x00, 0x00, 0x00, 0x20, 0x00, 0x7f, 0xff,
                                  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BBCCHH
                                  0x00, 0x00, 0x00, 0x00, 0x04};      // CCHHR

/*-------------------------------------------------------------------*/
/* Layout of a standard VOL1 label for CKD dasd                      */
/*-------------------------------------------------------------------*/
struct VOL1_CKD
{
    /* VOL1 label format for CKD devices:

      Dec    Len     Type         Description
       0      4      EBCDIC       Always "VOL1"
       4      6      EBCDIC       Volume Serial number
      10      1      Hex          Security byte (X'C0')
      11      5      Hex          CCHHR of the VTOC
      16     21      Reserved     EBCDIC X'40' spaces
      37     14      EBCDIC       Owner code for LVTOC listing
      51     29      Reserved     EBCDIC X'40' spaces
    */
    BYTE   vol1[ IPL1_KEYLEN ];   // Always "VOL1"
    BYTE   volser[ VOLSER_LEN ];  // Volume Serial number
    BYTE   security;              // Security byte (X'C0')
    HWORD  vtoc_CC;               // CCHHR of the VTOC
    HWORD  vtoc_HH;               // CCHHR of the VTOC
    BYTE   vtoc_R;                // CCHHR of the VTOC
    BYTE   rsrvd3[21];            // EBCDIC X'40' spaces
    BYTE   owner[14];             // Owner code for LVTOC listing
    BYTE   rsrvd4[29];            // EBCDIC X'40' spaces
};

/*-------------------------------------------------------------------*/
/* Layout of a standard VOL1 label for FBA dasd                      */
/*-------------------------------------------------------------------*/
struct VOL1_FBA
{
    /* VOL1 label format for FBA devices:

      Dec    Len     Type         Description
       0      4      EBCDIC       Always "VOL1"
       4      6      EBCDIC       Volume Serial number
      10      1      Hex          Security byte (X'C0')
      11      5      Unsigned     Sector number of the VTOC
      16      5      Reserved     EBCDIC X'40' spaces
      21      4      Unsigned     VTOC Control Interval size
      25      4      Unsigned     VTOC sectors per Control Interval
      29      4      Unsigned     VTOC DSCB slots per Control Interval
      33      4      Reserved     EBCDIC X'40' spaces
      37     14      EBCDIC       Volume Owner and Address
      51     29      Reserved     EBCDIC X'40' spaces
    */
    BYTE   vol1[ IPL1_KEYLEN ];   // Always "VOL1"
    BYTE   volser[ VOLSER_LEN ];  // Volume Serial number
    BYTE   security;              // Security byte (X'C0')
    BYTE   rsrvd1;                // X'00'
    FWORD  vtoc_block;            // Sector number of the VTOC
    BYTE   rsrvd2[5];             // EBCDIC X'40' spaces
    FWORD  vtoc_cisz;             // VTOC Control Interval size (bytes)
    FWORD  vtoc_seci;             // VTOC sectors per Control Interval
    FWORD  vtoc_slci;             // VTOC DSCB slots per Control Interval
    BYTE   rsrvd3[4];             // EBCDIC X'40' spaces
    BYTE   owner[14];             // Owner code for LVTOC listing
    BYTE   rsrvd4[29];            // EBCDIC X'40' spaces
};

/*-------------------------------------------------------------------*/
/* Definition of DSCB records in VTOC                                */
/*-------------------------------------------------------------------*/
struct DSXTENT {                        /* Dataset extent descriptor */
        BYTE    xttype;                 /* Extent type               */
        BYTE    xtseqn;                 /* Extent sequence number    */
        HWORD   xtbcyl;                 /* Extent begin cylinder     */
        HWORD   xtbtrk;                 /* Extent begin track        */
        HWORD   xtecyl;                 /* Extent end cylinder       */
        HWORD   xtetrk;                 /* Extent end track          */
};

/* Bit definitions for extent type */
#define XTTYPE_UNUSED           0x00    /* Unused extent descriptor  */
#define XTTYPE_DATA             0x01    /* Data extent               */
#define XTTYPE_OVERFLOW         0x02    /* Overflow extent           */
#define XTTYPE_INDEX            0x04    /* Index extent              */
#define XTTYPE_USERLBL          0x40    /* User label extent         */
#define XTTYPE_SHARCYL          0x80    /* Shared cylinders          */
#define XTTYPE_CYLBOUND         0x81    /* Extent on cyl boundary    */

struct FORMAT1_DSCB                     /* DSCB1: Dataset descriptor */
{
/*00*/  BYTE    ds1dsnam[44];           /* Key (44 byte dataset name)*/
/*2C*/  BYTE    ds1fmtid;               /* Format identifier (0xF1)  */
/*2D*/  BYTE    ds1dssn[6];             /* Volume serial number      */
/*33*/  HWORD   ds1volsq;               /* Volume sequence number    */
/*35*/  BYTE    ds1credt[3];            /* Dataset creation date...
                                           ...byte 0: Binary year-1900
                                           ...bytes 1-2: Binary day  */
/*38*/  BYTE    ds1expdt[3];            /* Dataset expiry date       */
/*3B*/  BYTE    ds1noepv;               /* Number of extents         */
/*3C*/  BYTE    ds1bodbd;               /* #bytes used in last dirblk*/
/*3D*/  BYTE    ds1flag1;               /* Flags byte                */
#define DS1LARGE                0x08    /* Large format data set     */

/*3E*/  BYTE    ds1syscd[13];           /* System code (IBMOSVS2)    */
/*4B*/  BYTE    ds1refdt[3];            /* Last reference date ('YDD'
                                           or 0 if not maintained).
                                           Add 1900 to 'Y' for year. */
/*4E*/  BYTE    ds1smsfg;               /* SMS indicators            */
#define DS1STRP                 0x04    /* Extended-format data set  */

/*4F*/  BYTE    ds1scext[3];            /* Secondary space extension */
/*52*/  BYTE    ds1dsorg[2];            /* Dataset organization      */
/*54*/  BYTE    ds1recfm;               /* Record format             */
/*55*/  BYTE    ds1optcd;               /* Option codes              */
/*56*/  HWORD   ds1blkl;                /* Block length              */
/*58*/  HWORD   ds1lrecl;               /* Logical record length     */
/*5A*/  BYTE    ds1keyl;                /* Key length                */
/*5B*/  HWORD   ds1rkp;                 /* Relative key position     */
/*5D*/  BYTE    ds1dsind;               /* Dataset indicators        */
/*5E*/  FWORD   ds1scalo;               /* Secondary allocation...
                                           ...byte 0: Allocation units
                                           ...bytes 1-3: Quantity    */
/*62*/  BYTE    ds1lstar[3];            /* Last used TTR (see below) */

/*                     PROGRAMMING NOTE

    For NORMAL datasets, the last block pointer (TTR) is in the
    DS1LSTAR field. So the size of the dataset in number of tracks
    is in the first two bytes (TT) of DS1LSTAR. (The last right-
    most byte of DS1LSTAR being the 'R' part of the 'TTR'.)

    For DSNTYPE=LARGE however, the size of the dataset is 3 bytes
    in size (i.e. TTT, not just TT). So you use the first two
    high-order bytes of DS1LSTAR (just like you do for for normal
    format datasets), but in addition to that, the high-order byte
    of the 3-byte TTT is kept in the DS1TTTHI field.
   
    For DSNTYPE=EXTENDED, the size of the dataset in tracks is of
    course 4 bytes in size (TTTT), with the low-order 2 bytes of
    that 4-byte TTTT coming from the high-order two bytes of the
    DS1LSTAR field (just for for normal/large format datasets),
    but the two HIGH-order bytes of the 4-byte TTTT is in DS1TRBAL.

            SUMMARY OF DATASET SIZE IN NUMBER OF TRACKS:

    Normal:      TT   =                high-order 2 bytes of ds1lstar
    Large:      TTT   =   ds1ttthi(1), high-order 2 bytes of ds1lstar
    Extended:  TTTT   =   ds1trbal(2), high-order 2 bytes of ds1lstar

*/
/*65*/  HWORD   ds1trbal;               /* Normal/Large: bytes unused
                                           on last track.
                                           Extended: high-order bytes
                                           of TTTTTR.                */
/*67*/  BYTE    resv1;                  /* Reserved                  */
/*68*/  BYTE    ds1ttthi;               /* Large format: high-order
                                           byte of TTTR.             */
/*69*/  DSXTENT ds1ext1;                /* First extent descriptor   */
/*73*/  DSXTENT ds1ext2;                /* Second extent descriptor  */
/*7D*/  DSXTENT ds1ext3;                /* Third extent descriptor   */
/*87*/  BYTE    ds1ptrds[5];            /* CCHHR of F2 or F3 DSCB    */
/*8C*/                                  /* Total len/size: 140 bytes */
};

/* Bit definitions for ds1dsind */
#define DS1DSIND_LASTVOL        0x80    /* Last volume of dataset    */
#define DS1DSIND_RACFIND        0x40    /* RACF indicated            */
#define DS1DSIND_BLKSIZ8        0x20    /* Blocksize multiple of 8   */
#define DS1DSIND_PASSWD         0x10    /* Password protected        */
#define DS1DSIND_WRTPROT        0x04    /* Write protected           */
#define DS1DSIND_UPDATED        0x02    /* Updated since last backup */
#define DS1DSIND_SECCKPT        0x01    /* Secure checkpoint dataset */

/* Bit definitions for ds1optcd */
#define DS1OPTCD_ICFDSET        0x80    /* Dataset in ICF catalog    */
#define DS1OPTCD_ICFCTLG        0x40    /* ICF catalog               */

/* Bit definitions for ds1scalo byte 0 */
#define DS1SCALO_UNITS          0xC0    /* Allocation units...       */
