/* VMFPLC2.C  (C) Copyright Ivan S. Warren 2010-2012                 */
/*            (C) Copyright "Fish" (David B. Trout), 2019            */
/*                                                                   */
/*                Hercules VM/CMS VMFPLC2/TAPE Utility               */
/*                                                                   */
/*   Released under "The Q Public License Version 1"                 */
/*   (http://www.hercules-390.org/herclic.html) as modifications to  */
/*   Hercules.                                                       */

/*   For usage instructions, refer to either the 'README.VMFPLC2'    */
/*   document or the "vmfplc2.1" man page.                           */

/**********************************************************************

                            CAVEATS

  EDF FST support has not been thoroughly tested. I have not tested
  dumping files (via the CMS vmfplc2 command) from CMS "EDF" format
  disks and loading them onto the host system, nor vice-versa (dump-
  ing from the host system and then loading onto a CMS "EDF" disk).

  There exists evidence (based on review of tools written by others)
  that the CMS 'TAPE' utility also sometimes creates (DUMP command)
  blocks with a "CMSF" or "CMSV" block header depending on whether
  the file being dumped is Fixed or Variable.  I have not seen this
  on VM/370 so I did not add any logic to handle these block types.


  the host system is required in order to know whether or not the
  file being loaded is Text or Binary since CMS does not provide
  such information in its FST.  Knowing this critical as it allows
  vmfplc2 to know whether or not to translate the data from tape
  to ASCII (from EBCDIC) before writing it to the host system and
  allows an *exact* copy of binary files to be transferred between
  the CMS guest and host system.  Text files however, might not be
  transferred exactly due to padding/trimming of trailing blanks
  as well as the ASCII<->EBCDIC translation codepage that is used.

**********************************************************************/

#include "hstdinc.h"

#include "hercules.h"
#include "tapedev.h"
#include "ccwarn.h"

#define UTILITY_NAME    "vmfplc2"
#define UTILITY_DESC    "VM/CMS VMFPLC2/TAPE Utility"

static char* pgm;       /* (initialized by INITIALIZE_UTILITY macro) */

/*-------------------------------------------------------------------*/
/*            Global constants and I/O buffers, etc...               */
/*-------------------------------------------------------------------*/

/*  VMFPLC2  PLC'H'  (FST)   tape block header     .PLCH             */
/*  VMFPLC2  PLC'D'  (data)  tape block header     .PLCD             */
/*  TAPE     CMS' '  (data)  tape block header     .CMS              */
/*  TAPE     CMS'N'  (name)  tape block header     .CMSN             */

#define                      BLK_HDRSIZE   5
static const BYTE  PLCH_hdr[ BLK_HDRSIZE ] = { 0x02, 0xD7, 0xD3, 0xC3, 0xC8 };
static const BYTE  PLCD_hdr[ BLK_HDRSIZE ] = { 0x02, 0xD7, 0xD3, 0xC3, 0xC4 };
static const BYTE  CMS__hdr[ BLK_HDRSIZE ] = { 0x02, 0xC3, 0xD4, 0xE2, 0x40 };
static const BYTE  CMSN_hdr[ BLK_HDRSIZE ] = { 0x02, 0xC3, 0xD4, 0xE2, 0xD5 };

/* NOTE:  Tape blocks will always be 5 bytes more than the
          below values to account for above block headers            */

#define PLC2_BLOCKSIZE        4000    /* size expected by VMFPLC2    */
#define CMS_BLOCKSIZE          800    /* size expected by CMS TAPE   */
#define MAX_PLC2_BLKSIZE     65535    /* max supported tape blksize  */

CASSERT( !(PLC2_BLOCKSIZE % CMS_BLOCKSIZE), vmfplc2_c );

static BYTE bfr [ MAX_PLC2_BLKSIZE ];     /* Primary I/O buffer      */
static BYTE wrk [ MAX_PLC2_BLKSIZE ];     /* host -> guest translate */

/* Valid character for CMS file-names and file-types                 */
static const char* validchars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                                "0123456789"
                                "$#@+-:_";

/* Valid CMS file-mode numbers                                       */
static const char* validfmnum = "0123456";

/* Default code page                                                 */
static const char* defaultcp = NULL;

/*-------------------------------------------------------------------*/
/*        Processing options and runtime status information          */
/*-------------------------------------------------------------------*/
struct OPTIONS
{
    const char*  cmd;         /* "vmfplc2.exe"                       */
    const char*  ctlfile;     /* input DUMP control file             */
    const char*  tapefile;    /* input or output (depends on verb)   */

    bool   cms;               /* true == 'TAPE' mode, else 'VMFPLC2' */
    bool   quiet;             /* true == suppress informational msgs */
    bool   comp;              /* true == .het compression, else .aws */
    bool   zlib;              /* true == compress w/zlib, else bzip2 */
    BYTE   level;             /* .het compression level (0..9)       */
    BYTE   verb;              /* LOAD/SCAN/DUMP (see #defines below) */

#define   DUMP_VERB     0
#define   LOAD_VERB     1
#define   SCAN_VERB     2

    DEVBLK devblk;            /* DEVBLK for tape I/O support         */
    BYTE   unitstat;          /* Dummy unitstat for tape I/O support */
};
typedef struct OPTIONS  OPTIONS;

/*-------------------------------------------------------------------*/
/*                    Return verb string                             */
/*-------------------------------------------------------------------*/
static const char* verb( OPTIONS* opts )
{
    if (DUMP_VERB == opts->verb) return "DUMP";
    if (LOAD_VERB == opts->verb) return "LOAD";
    if (SCAN_VERB == opts->verb) return "SCAN";
    return "???";
}

/*-------------------------------------------------------------------*/
/*              Display usage syntax and return -1                   */
/*-------------------------------------------------------------------*/
static int syntax()
{
    WRMSG( HHC02620, "I", pgm );    // "Usage: %s ...
    return -1;
}

/*-------------------------------------------------------------------*/
/*                    Parse the command line                         */
/*-------------------------------------------------------------------*/
/*                                                                   */
/*   Usage: %s [options] VERB <infile> | <ctlfile> <outfile>         */
/*                                                                   */
/*     VERB      desired action               (DUMP/LOAD/SCAN)       */
/*     ctlfile   filename of control file     (DUMP/LOAD only)       */
/*     tapein    filename of input tape file  (LOAD/SCAN only)       */
/*     tapeout   filename of output tape file (DUMP only)            */
/*                                                                   */
/*   Options:                                                        */
/*                                                                   */
/*     -c cp     desired translation codepage                        */
/*     -t        read/write tape in CMS 'TAPE' DUMP format           */
/*     -v        don't suppress certain informational messages       */
/*                                                                   */
/*     -u        create uncompressed .aws output                     */
/*     -z        create compressed .het output using zlib            */
/*     -b        create compressed .het output using bzip2           */
/*     -4        desired compression level (-1, -2 ... -9)           */
/*                                                                   */
/*-------------------------------------------------------------------*/
static int parse_parms( int ac, char* av[], OPTIONS* opts )
{
    int i, argc;

    /* Set default options */
    opts->cmd   = basename( av[0] );
    opts->quiet = true;
    opts->comp  = true;
    opts->zlib  = true;
    opts->level = HETDFLT_LEVEL;
    defaultcp   = query_codepage();

    if (opts->quiet) sysblk.msglvl &= ~MLVL_VERBOSE;
    else             sysblk.msglvl |=  MLVL_VERBOSE;

    /* Parse the options */
    for (argc=ac, i=1; i < argc && '-' == av[i][0]; i++)
    {
        switch (av[i][1])
        {
            case 't':

                opts->cms = true;
                break;

            case 'v':

                opts->quiet = false;
                sysblk.msglvl |= MLVL_VERBOSE;
                break;

            case 'u':

                opts->comp  = false;
                break;

            case 'z':

                opts->comp  = true;
                opts->zlib  = true;
                break;

            case 'b':

                opts->comp  = true;
                opts->zlib  = false;
                break;

            case 'c':

                if (!av[i+1])
                {
                    // "%s not specified"
                    FWRMSG( stderr, HHC02622, "E", "code page" );
                    return syntax();
                }

                if (!valid_codepage_name( av[i+1] ))
                {
                    // "Invalid %s \"%s\""
                    FWRMSG( stderr, HHC02621, "E", "code page", av[i+1] );
                    return syntax();
                }

                defaultcp = av[ ++i ];
                break;

            default:

                if (1
                    &&  av[i][1]
                    &&  av[i][1] >= '1'
                    &&  av[i][1] <= '9'
                    && !av[i][2]
                )
                {
                    opts->comp  = true;
                    opts->level = (av[i][1] & 0x0F);
                    break;
                }

                // "Invalid %s \"%s\""
                FWRMSG( stderr, HHC02621, "E", "option", av[i] );
                return syntax();
        }
    }

    /* Account for options just parsed */
    argc -= (i-1);

    /* Parse the action verb */

    if (argc < 2)
    {
        // "%s not specified"
        FWRMSG( stderr, HHC02622, "E", "VERB" );
        return syntax();
    }

         if (strcasecmp( av[i], "DUMP" ) == 0) opts->verb = DUMP_VERB;
    else if (strcasecmp( av[i], "SCAN" ) == 0) opts->verb = SCAN_VERB;
    else if (strcasecmp( av[i], "LOAD" ) == 0) opts->verb = LOAD_VERB;
    else
    {
        // "Invalid %s \"%s\""
        FWRMSG( stderr, HHC02621, "E", "function", av[i] );
        return syntax();
    }

    i++; /* (get past verb argument) */

    /* Each verb has its own set of required arguments */
    switch (opts->verb)
    {
        case SCAN_VERB:

            if (argc < 3)
            {
                // "%s not specified"
                FWRMSG( stderr, HHC02622, "E", "tape file" );
                return syntax();
            }

            opts->tapefile = av[i++];

            /* Force use of het handler which can read het or aws */
            opts->comp = true;
            break;

        case DUMP_VERB:
        case LOAD_VERB:

            if (argc < 3)
            {
                // "%s not specified"
                FWRMSG( stderr, HHC02622, "E", "ctlfile" );
                return syntax();
            }

            if (argc < 4)
            {
                // "%s not specified"
                FWRMSG( stderr, HHC02622, "E",
                    DUMP_VERB == opts->verb ? "outfile" : "infile" );
                return syntax();
            }

            opts->ctlfile  = av[i++];
            opts->tapefile = av[i++];
            break;
    }

    /* Check for any extraneous (leftover) arguments */
    if (av[i])
    {
        // "Invalid %s \"%s\""
        FWRMSG( stderr, HHC02621, "E", "argument", av[i] );
        return syntax();
    }

    // "%s tape format set to %s"
    WRMSG( HHC02637, "I",
        DUMP_VERB == opts->verb ? "Output" : "Input",
        opts->cms ? "CMS TAPE" : "VMFPLC2" );

    return 0;
}

/*********************************************************************/
/*********************************************************************/
/**                                                                 **/
/**           TAPE MANAGEMENT STRUCTURES AND FUNCTIONS              **/
/**                                                                 **/
/*********************************************************************/
/*********************************************************************/

/*-------------------------------------------------------------------*/
/* the TAPE_BLOCK structure represents a single tape block */
/*-------------------------------------------------------------------*/
typedef struct TAPE_BLOCK   TAPE_BLOCK;

struct TAPE_BLOCK
{
    BYTE*        data;
    size_t       sz;
    TAPE_BLOCK*  next;
};

/*-------------------------------------------------------------------*/
/* The TAPE_BLOCKS structure represents a collection of tape blocks  */
/*-------------------------------------------------------------------*/
struct TAPE_BLOCKS
{
    const BYTE*  hdr;           /* Header to append to every record  */
    size_t       hdrsz;         /* Size of header                    */
    size_t       blksz;         /* Maximum block size                */
    size_t       blk_modulo;    /* Must be a multiple of this        */
    size_t       blk_count;     /* Number of blocks in chain         */
    TAPE_BLOCK*  first;         /* First block in chain              */
    TAPE_BLOCK*  current;       /* Working block                     */
};
typedef struct TAPE_BLOCKS  TAPE_BLOCKS;

/*-------------------------------------------------------------------*/
/*                      Close tape                                   */
/*-------------------------------------------------------------------*/
static void tape_close( OPTIONS* opts )
{
    if (opts->comp)
        close_het( &opts->devblk );
    else
        close_awstape( &opts->devblk );
}

/*-------------------------------------------------------------------*/
/*                       Open tape                                   */
/*-------------------------------------------------------------------*/
static int tape_open( OPTIONS* opts )
{
    int rc;

    /* Initialize SYSBLK and DEVBLK fields for open of tape device */

    sysblk.auto_tape_create = (DUMP_VERB == opts->verb) ? 1 : 0;

    opts->devblk.tdparms.auto_create      =  sysblk.auto_tape_create;
    opts->devblk.tdparms.logical_readonly = !sysblk.auto_tape_create;
    opts->devblk.tdparms.compress         = opts->comp;
    opts->devblk.tdparms.method           = opts->zlib ? HETMETH_ZLIB : HETMETH_BZLIB;
    opts->devblk.tdparms.level            = opts->level;
    opts->devblk.tdparms.chksize          = HETDFLT_CHKSIZE;
    opts->devblk.devtype                  = 0x3590;
    opts->devblk.batch                    = 1; // enable quiet flag
    opts->devblk.quiet                    = opts->quiet;

    STRLCPY( opts->devblk.filename, opts->tapefile );

    if (opts->comp)
    {
        if ((rc = open_het( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "open_het()", het_error( rc ));
    }
    else
    {
        if ((rc = open_awstape( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "open_awstape()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                       Rewind tape                                 */
/*-------------------------------------------------------------------*/
static int tape_rewind( OPTIONS* opts )
{
    int rc;

    if (opts->comp)
    {
        if ((rc = rewind_het( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "rewind_het()", het_error( rc ));
    }
    else
    {
        if ((rc = rewind_awstape( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "rewind_awstape()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                   Forward Space Block tape                        */
/*-------------------------------------------------------------------*/
static int tape_fsb( OPTIONS* opts )
{
    int rc;

    if (opts->comp)
    {
        if ((rc = fsb_het( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "fsb_het()", het_error( rc ));
    }
    else
    {
        if ((rc = fsb_awstape( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "fsb_awstape()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                Retrieve current tape position                     */
/*-------------------------------------------------------------------*/
static int tape_get_position( OPTIONS* opts )
{
    return opts->devblk.blockid;
}

/*-------------------------------------------------------------------*/
/*               Position tape to specific block                     */
/*-------------------------------------------------------------------*/
static int tape_set_position( OPTIONS* opts, U32 blockid )
{
    int rc;

    if ((rc = tape_rewind( opts )) >= 0)
    {
        opts->devblk.curfilen   =  1;
        opts->devblk.nxtblkpos  =  0;
        opts->devblk.prvblkpos  = -1;
        opts->devblk.blockid    =  0;

        while (opts->devblk.blockid < blockid && rc >= 0)
            rc = tape_fsb( opts );
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                       Read tape                                   */
/*-------------------------------------------------------------------*/
static int tape_read( OPTIONS* opts )
{
    int rc;

    if (opts->comp)
    {
        if ((rc = read_het( &opts->devblk, bfr, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "read_het()", het_error( rc ));
    }
    else
    {
        if ((rc = read_awstape( &opts->devblk, bfr, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "read_awstape()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                    Write a single tape mark                       */
/*-------------------------------------------------------------------*/
static int tape_write_mark( OPTIONS* opts )
{
    int rc;

    if (opts->comp)
    {
        if ((rc = write_hetmark( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "write_hetmark()", het_error( rc ));
    }
    else
    {
        if ((rc = write_awsmark( &opts->devblk, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "write_awsmark()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*                 Write a block of data to tape                     */
/*-------------------------------------------------------------------*/
int tape_write_block( OPTIONS* opts, const BYTE* bfr, int sz )
{
    int rc;

    if (opts->comp)
    {
        if ((rc =  write_het( &opts->devblk, bfr, sz, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "write_het()", het_error( rc ));
    }
    else
    {
        if ((rc = write_awstape( &opts->devblk, bfr, sz, &opts->unitstat, 0 )) < 0)
            // "Error in function %s: %s"
            FWRMSG( stderr, HHC02624, "E", "write_awstape()", strerror( errno ));
    }

    return rc;
}

/*-------------------------------------------------------------------*/
/*    Write TAPE_BLOCK and adjust the block size to a modulo         */
/*                 (without counting the header)                     */
/*-------------------------------------------------------------------*/
static int write_TAPE_BLOCK( OPTIONS* opts, const TAPE_BLOCK* tb, size_t mod, size_t hdrsz )
{
    size_t  sz;

    sz = (tb->sz - hdrsz) / mod;
    if ( (tb->sz - hdrsz) % mod)
        sz++;

    sz *= mod;
    sz += hdrsz;

    return tape_write_block( opts, tb->data, (int) sz );
}

/*-------------------------------------------------------------------*/
/*             Write a collection of blocks to tape                  */
/*-------------------------------------------------------------------*/
static int write_TAPE_BLOCKS( OPTIONS* opts, const TAPE_BLOCKS* tbs)
{
    TAPE_BLOCK* tb;
    int rc;

    tb = tbs->first;

    while (tb)
    {
        if ((rc = write_TAPE_BLOCK( opts, tb, tbs->blk_modulo, tbs->hdrsz )) < 0)
            return rc;
        tb = tb->next;
    }

    return 0;
}

/*-------------------------------------------------------------------*/
/*            Initialize a collection of tape blocks                 */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS* init_blocks( size_t blksz, size_t modulo, const BYTE* hdr, int hdrsz )
{
    TAPE_BLOCKS*  tbs;

    if (!(tbs = malloc( sizeof( TAPE_BLOCKS ))))
        return NULL;

    tbs->hdr        = hdr;
    tbs->hdrsz      = hdrsz;
    tbs->blksz      = blksz;
    tbs->blk_count  = 0;
    tbs->blk_modulo = modulo;
    tbs->first      = NULL;
    tbs->current    = NULL;

    return tbs;
}

/*-------------------------------------------------------------------*/
/*       Add a chunk of data to a collection of tape blocks          */
/*-------------------------------------------------------------------*/
static int append_data( TAPE_BLOCKS* tbs, const BYTE* bfr, size_t bfr_bytes )
{
    TAPE_BLOCK* tb;
    int bfr_offset;
    int cpy_amount;

    bfr_offset = 0;

    while (bfr_bytes)   /* while bytes remain to be appended */
    {
        /* Allocate a new tape block if we don't have one yet,
           or if the current block is full (no room remains).
        */
        if (0
            || !tbs->current
            ||  tbs->current->sz >= (tbs->hdrsz + tbs->blksz)
        )
        {
            /* Allocate a new TAPE_BLOCK structure */
            if (!(tb = malloc( sizeof( TAPE_BLOCK ))))
                return -1;

            tb->next = NULL;
            tb->sz   = 0;

            /* First one? */
            if (!tbs->first)
            {
                tbs->first   = tb;
                tbs->current = tb;
            }
            else /* No, chain to previous */
            {
                tbs->current->next = tb;
                tbs->current       = tb;
            }

            /* Track number of blocks in chain */
            tbs->blk_count++;

            /* Allocate room for the actual tape block */
            if (!(tb->data = malloc( tbs->hdrsz + tbs->blksz )))
                return -1;

            /* Initialize block header and clear remainder */
            memcpy( tb->data, tbs->hdr, tbs->hdrsz );
            memset( tb->data + tbs->hdrsz, 0, tbs->blksz );

            /* Initialize the current tape blocks size (i.e. how much
               actual data it currently holds: just hdr at the moment)
            */
            tb->sz = tbs->hdrsz; /* (just the header at the moment) */
        }
        else
        {
            /* Otherwise append data to end of current block */
            tb = tbs->current;
        }

        /* Calculate how much room remains in the current tape block */
        cpy_amount = (int) MIN( bfr_bytes, (tbs->hdrsz + tbs->blksz) - tb->sz );

        /* Append as much data as possible to end of current block */
        memcpy( &tb->data[ tb->sz ], &bfr[ bfr_offset ], cpy_amount );

        /* Update current block size, bfr offset and bytes remaining */
        tb->sz     += cpy_amount;
        bfr_offset += cpy_amount;
        bfr_bytes  -= cpy_amount;
    }

    return 0;
}

/*-------------------------------------------------------------------*/
/*              Release a collection of tape blocks                  */
/*-------------------------------------------------------------------*/
static void free_blocks( TAPE_BLOCKS* tbs )
{
    TAPE_BLOCK *tb, *ntb;

    if (!tbs)
        return;

    tb = tbs->first;

    while (tb)
    {
        free( tb->data );
        ntb = tb->next;
        free( tb );
        tb = ntb;
    }

    free( tbs );
}

/*********************************************************************/
/*********************************************************************/
/**                                                                 **/
/**         FILE RECORDS MANAGEMENT STRUCTURES & FUNCTIONS          **/
/**                                                                 **/
/*********************************************************************/
/*********************************************************************/

/*-------------------------------------------------------------------*/
/*    RECS struct:  a file with its collection of tape blocks        */
/*-------------------------------------------------------------------*/
struct RECS
{
    TAPE_BLOCKS*  blocks;
    size_t        filesz;
    int           reccount;
    int           reclen;
    char          recfm;
};
typedef struct RECS     RECS;

/*-------------------------------------------------------------------*/
/*              Initialize a new RECS structure                      */
/*-------------------------------------------------------------------*/
static RECS* initrecs( OPTIONS* opts, char recfm, int recl, const BYTE* hdr, int hdrsz )
{
    RECS*  recs;
    size_t blksz = opts->cms ? CMS_BLOCKSIZE : PLC2_BLOCKSIZE;

    if (!(recs = malloc( sizeof( RECS ))))
        return NULL;

    recs->blocks   = init_blocks( blksz, CMS_BLOCKSIZE, hdr, hdrsz );
    recs->filesz   = 0;
    recs->reccount = 0;
    recs->reclen   = recl;
    recs->recfm    = recfm;

    return recs;
}

/*-------------------------------------------------------------------*/
/* Add 1 (recfm V) or multiple (recfm F) records to a RECS structure */
/* and to the related tape block collection.                         */
/*-------------------------------------------------------------------*/
static int addrecs( RECS* recs, const BYTE* bfr, int sz )
{
    BYTE recd[2];   // (guest BIG-ENDIAN format)
    int rc;

    recs->filesz += sz;

    switch (recs->recfm)
    {
        case 'V': // (variable)

            store_hw( recd, (U16) sz );

            if (0
                || (rc = append_data( recs->blocks, recd,  2 )) != 0
                || (rc = append_data( recs->blocks, bfr,  sz )) != 0
            )
                return rc;

            recs->reccount++;
            recs->reclen = MAX( recs->reclen, sz );
            break;

        case 'F': // (fixed)

            if ((rc = append_data( recs->blocks, bfr, sz )) != 0)
                return rc;
            break;
    }

    return 0;
}

/*-------------------------------------------------------------------*/
/*                    Close a RECS structure.                        */
/*-------------------------------------------------------------------*/
/* The RECS structue is released and the collection of tape blocks   */
/* is returned for subsequent writing.  For empty files, a dummy     */
/* record is created since CMS does not support empty files.  The    */
/* last record of a RECFM F file is also padded if necessary.        */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS*  flushrecs( RECS* recs,
                                int*     recl,
                                int*     recc,
                                size_t*  filesz,
                                BYTE     pad )
{
    TAPE_BLOCKS* blks;
    int residual;
    int rc;

    if (!recs->filesz)
    {
        if ((rc = append_data( recs->blocks, &pad, 1 )) != 0)
            return NULL;

        recs->filesz = 1;

        if (recs->recfm == 'V')     // (variable)
        {
            recs->reccount = 1;
            recs->reclen   = 1;
        }
    }

    if (recs->recfm == 'F')         // (fixed)
    {
        /* Check if we need to do any padding */
        residual  = recs->reclen - (recs->filesz % recs->reclen);
        residual %= recs->reclen;

        if (residual)  /* (do we need to pad?) */
        {
            BYTE* padbfr;

            if (!(padbfr = malloc( residual )))
                return NULL;

            /* Fill work buffer with requested padding character */
            memset( padbfr, pad, residual );

            /* Add padding to reach proper fixed record size */
            if ((rc = append_data( recs->blocks, padbfr, residual )) != 0)
                return NULL;

            free( padbfr );

            recs->filesz += residual;   /* (fix the file size) */
        }

        recs->reccount = (int) recs->filesz / recs->reclen;
    }

    /* Pass updated values back to caller */

    *recl   = recs->reclen;
    *recc   = recs->reccount;
    *filesz = recs->filesz;

    blks = recs->blocks;

    free( recs );

    return blks;
}

/*-------------------------------------------------------------------*/
/*            Process a binary file for DUMP function                */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS* dump_binary_file( OPTIONS* opts,
                                      const char* infile, char recfm,
                                      int* recl, int* recc, size_t* filesz )
{
    TAPE_BLOCKS*  blks;
    FILE*         ifile;
    RECS*         recs;
    const BYTE*   hdr;
    int           rsz;

    /* Allocate and initialize a new RECS collection for this file */
    hdr = opts->cms ? CMS__hdr : PLCD_hdr;
    if (!(recs = initrecs( opts, recfm, *recl, hdr, BLK_HDRSIZE )))
        return NULL;

    /* Open this file for reading */
    if (!(ifile = fopen( infile, "rb" )))
    {
        // "File open error: \"%s\": %s"
        FWRMSG( stderr, HHC02623, "E", infile, strerror( errno ));
        return NULL;
    }

    /* Add all of this file's data to our RECS collection */
    while ((rsz = (int) fread( bfr, 1, MAX_PLC2_BLKSIZE, ifile )) != 0)
        if (addrecs( recs, bfr, rsz) != 0)
            return NULL;

    /* Check for I/O error */
    if (ferror( ifile ))
    {
        // "I/O error on file \"%s\": %s"
        FWRMSG( stderr, HHC02627, "E", infile, strerror( errno ));
        VERIFY( fclose( ifile ) == 0 );
        return NULL;
    }

    /* Close the file */
    VERIFY( fclose( ifile ) == 0 );

    /* Create a TAPE_BLOCKS collection and discard RECS collection */
    blks = flushrecs( recs, recl, recc, filesz, 0x40 );

    return blks;
}

/*-------------------------------------------------------------------*/
/*            Process a textual file for DUMP function               */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS* dump_text_file( OPTIONS* opts,
                                    const char* infile, char recfm,
                                    int* recl, int* recc, size_t* filesz )
{
    TAPE_BLOCKS*  blks;
    FILE*         ifile;
    RECS*         recs;
    const BYTE*   hdr;
    char*         rec;
    int           rsz, maxrsz = 0;
    bool          truncated = false;

    /* Allocate and initialize a new RECS collection for this file */
    hdr = opts->cms ? CMS__hdr : PLCD_hdr;
    if (!(recs = initrecs( opts, recfm, *recl, hdr, BLK_HDRSIZE )))
        return NULL;

    /* Open this file for reading */
    if (!(ifile = fopen( infile, "r" )))
    {
        // "File open error: \"%s\": %s"
        FWRMSG( stderr, HHC02623, "E", infile, strerror( errno ));
        return NULL;
    }

    /* Add all of this file's data to our RECS collection */
    while ((rec = fgets( (char*)bfr, sizeof( bfr ), ifile )) != NULL)
    {
        /* Get length */
        rsz = (int) strlen( rec );

        /* Remove newline (if present) and adjust length */
        if (rsz && rec[ rsz - 1 ] == '\n')
            rec[ --rsz ] = 0;

        /* If fixed, pad or truncate record to specified length */
        if (recfm == 'F')
        {
            /* Pad or truncate the record as needed */
            if (rsz < *recl )
                memset( &rec[rsz], ' ', *recl - rsz );  // (pad)
            else if (rsz > *recl)
            {
                maxrsz = MAX( rsz, maxrsz );
                rec[ *recl ] = 0;  // (truncate)
                truncated = true;
            }
            rsz = *recl;
        }
        else // (recfm == 'V')
        {
            /* If empty line, change it to a single blank */
            if (!rsz)
            {
                rec[0] = ' ';
                rec[ rsz = 1 ] =  0;
            }
        }

        /* Translate textual data from ASCII to EBCDIC */
        str_host_to_guest( rec, wrk, rsz );

        /* Add this record to our RECS collection */
        if (addrecs( recs, wrk, rsz ) != 0)
            return NULL;
    }

    /* Check for I/O error */
    if (ferror( ifile ))
    {
        // "I/O error on file \"%s\": %s"
        FWRMSG( stderr, HHC02627, "E", infile, strerror( errno ));
        VERIFY( fclose( ifile ) == 0 );
        return NULL;
    }

    /* Close the file */
    VERIFY( fclose( ifile ) == 0 );

    /* Create a TAPE_BLOCKS collection and discard RECS collection */
    blks = flushrecs( recs, recl, recc, filesz, 0x40 );

    if (truncated)
        // "lrecl %u less than %u; one or more records truncated"
        FWRMSG( stderr, HHC02628, "W", *recl, maxrsz );

    return blks;
}

/*-------------------------------------------------------------------*/
/*           Process a structured file for DUMP function             */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS* dump_structured_file( OPTIONS* opts,
                                          const char* infile, char recfm,
                                          int* recl, int* recc, size_t* filesz )
{
    TAPE_BLOCKS*  blks;
    FILE*         ifile;
    RECS*         recs;
    const BYTE*   hdr;
    size_t        num;
    int           rsz;
    uint16_t      rlbfr;

    /* Allocate and initialize a new RECS collection for this file */
    hdr = opts->cms ? CMS__hdr : PLCD_hdr;
    if (!(recs = initrecs( opts, recfm, *recl, hdr, BLK_HDRSIZE )))
        return NULL;

    /* Open this file for reading */
    if (!(ifile = fopen( infile, "rb" )))
    {
        // "File open error: \"%s\": %s"
        FWRMSG( stderr, HHC02623, "E", infile, strerror( errno ));
        return NULL;
    }

    /* Read the structured record's length */
    while ((num = fread( &rlbfr, 1, sizeof( rlbfr ), ifile )) == sizeof( rlbfr ))
    {
        rsz = fetch_hw( &rlbfr );

        /* Now that we know how big the record is,
           read the actual structure record itself. */
        if ((int)(num = fread( bfr, 1, rsz, ifile )) != rsz)
        {
            if (ferror( ifile ))
                // "I/O error on file \"%s\": %s"
                FWRMSG( stderr, HHC02627, "E", infile, strerror( errno ));
            else
                // "Expected %d bytes from file \"%s\", but only %d bytes read"
                FWRMSG( stderr, HHC02629, "E", rsz, infile, (int) num );

            VERIFY( fclose( ifile ) == 0 );
            return NULL;
        }

        /* Add this record to this file's RECS collection */
        if (addrecs( recs, bfr, rsz ) != 0)
            return NULL;
    }

    /* Short read or I/O error? */
    if (num || ferror( ifile ))
    {
        if (num)
            // "Expected %d bytes from file \"%s\", but only %d bytes read"
            FWRMSG( stderr, HHC02629, "E", (int) sizeof( rlbfr ), infile, (int) num );
        else
            // "I/O error on file \"%s\": %s"
            FWRMSG( stderr, HHC02627, "E", infile, strerror( errno ));

        VERIFY( fclose( ifile ) == 0 );
        return NULL;
    }

    /* Close the file */
    VERIFY( fclose( ifile ) == 0 );

    /* Create a TAPE_BLOCKS collection and discard RECS collection */
    blks = flushrecs( recs, recl, recc, filesz, 0x40 );

    return blks;
}

/*-------------------------------------------------------------------*/
/*                 Process file for DUMP function                    */
/*-------------------------------------------------------------------*/
static TAPE_BLOCKS* dump_file( OPTIONS* opts,
                               const char* infile, char filefmt, char recfm,
                               int* recl, int* recc, size_t* filesz )
{
    TAPE_BLOCKS* blks;

    switch (filefmt)
    {
        case 'B': blks = dump_binary_file     ( opts, infile, recfm, recl, recc, filesz ); break;
        case 'T': blks = dump_text_file       ( opts, infile, recfm, recl, recc, filesz ); break;
        case 'S': blks = dump_structured_file ( opts, infile, recfm, recl, recc, filesz ); break;
        default:
            // "INTERNAL ERROR %s"
            FWRMSG( stderr, HHC02634, "E", "0001" );
            return NULL;
    }

    return blks;
}

/*-------------------------------------------------------------------*/
/*         File Status Table (FST) as expected by VMFPLC2            */
/*-------------------------------------------------------------------*/
struct FST                  /* File Status Table (FST)               */
{
/*      Basic (short) FST = 40 bytes                                 */

/*000*/ BYTE   fn[8];       /* File name                             */
/*008*/ BYTE   ft[8];       /* File type                             */
/*010*/ BYTE   dt[4];       /* date: MMDDhhmm                  (DCB) */
/*014*/ HWORD  wp;          /* Write ptr                             */
/*016*/ HWORD  rp;          /* Read ptr                              */
/*018*/ BYTE   fm[2];       /* File mode                             */
/*01A*/ HWORD  reccount;    /* 16 bit record count                   */
/*01C*/ HWORD  fcl;         /* First chain link                      */
/*01E*/ BYTE   recfm;       /* Record fmt                   (F or V) */
/*01F*/ BYTE   flag1;       /* Flags                                 */
#define FSTCNTRY  0x08      /* Century for year and adt: 0=19, 1=20  */
/*020*/ FWORD  lrecl;       /* 32 bit record length                  */
/*024*/ HWORD  dbc;         /* 800-byte Data Block Count             */
/*026*/ BYTE   year[2];     /* Last 2 digits of year (YY)   (EBCDIC) */
/*028*/                     /* Size of Basic (short) FST = 40 bytes  */

/*      The following two fields are VMFPLC2 specific                */

/*028*/ FWORD  lastsz;      /* num 800 byte blocks in last record    */
/*02C*/ FWORD  numblk;      /* num complete 4000 byte records        */

/*      Extended EDF FST (BSEPP and later) = 64 bytes                */

/*030*/ FWORD  afop;        /* Alt File Origin Ptr                   */
/*034*/ FWORD  adbc;        /* Alt Data Block Count                  */
/*038*/ FWORD  aic;         /* Alt Item Count                        */
/*03C*/ BYTE   levels;      /* Levels of indirection                 */
/*03D*/ BYTE   ptrsz;       /* Size of Pointers                      */
/*03E*/ BYTE   adt[6];      /* Alt Date: YYMMDDHHMMSS          (DCB) */
/*044*/ BYTE   extra[4];    /* Reserved                              */
/*048*/                     /* Size of Extended EDF FST = 64 bytes   */
};
typedef struct FST  FST;    /* Just a shorter name than "struct FST" */
CASSERT( sizeof( FST ) == 72, vmfplc2_c );

/* Empty FST Alternate Date field */
#define SIZEOF_STRUCT_MEM( s, m )   sizeof(((s*)0)->m)
static const BYTE empty_adt[ SIZEOF_STRUCT_MEM( FST, adt )] = {0};

/*-------------------------------------------------------------------*/
/*  CMS 'TAPE DUMP' command '.CMSN' "name" tape block header format  */
/*-------------------------------------------------------------------*/
struct CMS                  /* CMS TAPE DUMP block layout            */
{
/*000*/ HWORD  wp;          /* Write ptr                             */
/*002*/ HWORD  rp;          /* Read ptr                              */
/*004*/ HWORD  mode;        /* Mode                                  */
/*006*/ HWORD  reccount;    /* 16 bit record count                   */
/*008*/ HWORD  fcl;         /* First chain link                      */
/*00A*/ BYTE   recfm;       /* Record fmt                   (F or V) */
/*00B*/ BYTE   flag1;       /* Flags                                 */
/*00C*/ FWORD  lrecl;       /* 32 bit record length                  */
/*010*/ HWORD  dbc;         /* 800-byte Data Block Count             */
/*012*/ BYTE   year[2];     /* Last 2 digits of year (YY)   (EBCDIC) */
/*014*/ BYTE   dt[4];       /* date: MMDDhhmm                  (DCB) */

    /* Beginning of alternate counts (added with EDF file system)    */

/*018*/ FWORD  afop;        /* Alt File Origin Ptr                   */
/*01C*/ FWORD  adbc;        /* Alt Data Block Count                  */
/*020*/ FWORD  aic;         /* Alt Item Count                        */
/*024*/ BYTE   levels;      /* Levels of indirection                 */
/*025*/ BYTE   ptrsz;       /* Size of Pointers                      */
/*026*/ BYTE   adt[6];      /* Alt Date: YYMMDDHHMMSS          (DCB) */
/*02C*/ BYTE   extra[4];    /* Reserved                              */
/*030*/ BYTE   pad[16];     /* (pad to to 64 bytes)                  */

    /* Filename appended following FST                               */

/*040*/ BYTE   fn[8];       /* File name                             */
/*048*/ BYTE   ft[8];       /* File type                             */
/*050*/ BYTE   fm[2];       /* File mode                             */
/*052*/                     /* Total length of structure             */
};
typedef struct CMS  CMS;    /* Just a shorter name than "struct CMS" */
CASSERT( sizeof( CMS ) == 82, vmfplc2_c );

/*-------------------------------------------------------------------*/
/* Convert single byte decimal value to DCB (Decimal Coded Binary)   */
/*-------------------------------------------------------------------*/
static BYTE to_dcb( BYTE v )
{
    return ((v/10) * 16) + (v % 10);        // 0x1C (28) ==> 0x28
}

/*-------------------------------------------------------------------*/
/* Convert single byte DCB (Decimal Coded Binary) value to binary    */
/*-------------------------------------------------------------------*/
static BYTE from_dcb( BYTE v )
{
    return ((v >> 4) * 10) + (v & 0x0F);    // 0x28 (28) ==> 0x1C
}

/*-------------------------------------------------------------------*/
